Repository: vookimedlo/dictionary-ios
Catalog: src/*.lproj/Localizable.strings
Languages: cs

source: abbreviation
cs: zkratka

source: adjectives
cs: přídavná jména

source: adverbs
cs: příslovce

source: American
cs: americká angličtina

source: astronomy
cs: astronomie

source: Australian
cs: australská angličtina

source: automotive industry
cs: automobilový průmysl

source: aviation
cs: letectví

source: biology
cs: biologie

source: boats, shipping
cs: lodní doprava

source: botany
cs: botanika

source: British
cs: britská angličtina

source: building industry, architecture
cs: stavitelství, architektura

source: ceramic industry
cs: hrnčířství

source: coating technology
cs: povrchová technologie

source: colloquially
cs: hovorově

source: conjunctions
cs: spojky

source: Dictionary English-Czech
cs: Slovník Anglicko-Český

source: ecology
cs: ekologie

source: electrical engineering
cs: elektrotechnika

source: finance
cs: finančnictví

source: food processing
cs: potravinářství

source: generic
cs: obecně

source: geodesy
cs: geodézie

source: geography
cs: geografie

source: geology
cs: geologie

source: historical expression or name
cs: historický výraz nebo jméno

source: chemistry
cs: chemie

source: childish
cs: naivně

source: idiom
cs: ustálené spojení

source: in clipboard
cs: ve schránce

source: information technology
cs: informatika

source: interjections
cs: citoslovce

source: irregular verb
cs: nepravidelné sloveso

source: jokingly
cs: žertovně

source: legal
cs: právnicky

source: linguistic
cs: lingvistika

source: literary
cs: spisovně

source: mathematics
cs: matematika

source: medical term
cs: lékařství

source: metallurgy
cs: metalurgie

source: metaphorically
cs: metafrasticky

source: meteorology
cs: meteorologie

source: military terminology
cs: vojenství

source: mining, mineralogy
cs: hornictví, mineralogie

source: musical terminology
cs: hudební

source: mythological
cs: mytologie

source: no
cs: ne

source: not specified
cs: nespecifikováno

source: nouns
cs: podstatná jména

source: nuclear physics, technology
cs: jaderná fyzika

source: numerals
cs: číslovky

source: old use, archaic
cs: zastarale

source: optics
cs: optika

source: phrasal verb
cs: frázové sloveso

source: phrase
cs: rčení

source: physics
cs: fyzika

source: poeticism
cs: básnictví

source: political expression
cs: politika

source: prepositions
cs: předložky

source: pronouns
cs: zájmena

source: proper name
cs: vlastní jméno

source: psychological
cs: psychologie

source: railway transport
cs: železniční doprava

source: Scottish
cs: skotská angličtina

source: sexual expression
cs: sexuální podtext

source: slangily
cs: slangově

source: sport related locution
cs: sport

source: sugar industry
cs: cukrovarnictví

source: tanning industry
cs: koželužnictví

source: technical domain
cs: technicky

source: term from the field of agriculture
cs: zemědělství

source: textile industry
cs: textilní průmysl

source: uncommon
cs: neobvykle

source: verbs
cs: slovesa

source: vulgarism
cs: vulgarita

source: wood industry
cs: dřevozpracující průmysl

source: word related to religion
cs: regionální

source: yes
cs: ano

source: zoology
cs: zoologie
